Git - это расспределенная  система контроля версии
имеет два место для хранения  локальная и репразиторий это система для отслеживания и ведение историии изменений ваших историй 
Репозиторий - хранилище ваших файлов которые вы отлеживаете при помощи гита и их изменения.

 Команды git - нужен для того чтобы создать новый репозиторий на локальном пк ,создает она в той директории где вы запускаете эту команду .
 git add -  когда мы созаем и изменяем файлы  то припомощи этой команды мы загружаем все изменения в промежуточное место хранения 
  git add < file_name>
  git add . -> все в текущей директории 
  
  git commit - как только мы настигаем определенного момента в разработке то мы тогда сохраняем и коментируем все наши изменения в репозитории тоесть это команда нашей фиксации изменений в репо . )
  git commit -m ' <comment>' - 
  .hello 
